[
  {
    "lang": "en",
    "page": {
      "navbar": {
        "home": "Home",
        "about": "About",
        "howitworks": "How It Works"
      },
      "home": {
        "header": "Async Multilingual React",
        "subtitle":
          "Asynchronous Multilingual single-page app with React & Redux",
        "text1":
          "Offering content in several languages definitely add complexity to the process of development of any web site.This template intends to be a solution or at least a suggestion when working with React and Redux."
      },
      "about": {
        "header": "About",
        "text1":
          "This is a template for a multilingual single-page web application. It contains a top navigation bar with buttons and links to different pages, making possible to switch instantly languages in every section of the web, without redirecting to the homepage.",
        "text2":
          "The app uses React 16 generated by create-react-app library. The state of the application is managed by Redux. React-Router 4 helps to dynamic routing the SPA. Lastly, Material-UI is used to minimal style the app.",
        "text3":
          "Although is easier to load the texts synchronously, I needed an async  solution for a project I was working. This template can be very handy when dealing with a server side. "
      },
      "howitworks": {
        "header": "How It Works",
        "text1":
          "It parses the Accept-Language header to detect the user’s preferred language. In the case of this demo, if the language preferred is not available (english, greek, spanish), it loads english by default.",
        "text2":
          "The texts are located in a json file. This JSON loads asynchronously when a redux action is triggered.  The app loads the language used by default in a browser. ",
        "text3":
          "The languages available are listed in the top bar and will dispatch an action every time they are selected, switching instantly without refreshing the whole site. Axios library is used to managed the async process."
      }
    }
  },
  {
    "lang": "es",
    "page": {
      "navbar": {
        "home": "Inicio",
        "about": "Qué es",
        "howitworks": "Cómo funciona"
      },
      "home": {
        "header": "React Multilingüe Async",
        "subtitle":
          "Aplicación de página única multilingüe asincrónica con React, Redux y React-Router",
        "text1":
          "Ofrecer contenido en varios idiomas definitivamente añade complejidad al proceso de desarrollo de cualquier sitio o aplicación web, y ésta plantilla intenta brindar una solución utilizando React y Redux"
      },
      "about": {
        "header": "Qué es",
        "text1":
          "Esta es una plantilla para una aplicación de página única (SPA). Tiene una barra   de navegación superior con links a diferentes partes de la misma, haciendo posible el cambio instantáneo de idiomas en cada una de ellas sin actualizar ni enviar al Inicio",
        "text2":
          "La plantilla utiliza React 16 generado por la libreria create-react-app. El estado de la aplicación es manejado por Redux. React-Router v4 es utilizado para el enrutamiento de la SPA. Finalmente, Material-UI es la herramienta usada para estilar minimamente. ",
        "text3":
          "Esta plantilla puede ser útil cuando se trabaja desde el lado del servidor."
      },
      "howitworks": {
        "header": "Cómo funciona",
        "text1":
          "Parsea el encabezado Accept-Language para detectar el idioma preferido del usuario. En el caso de esta plantilla, si el idioma preferido (inglés, castellano y griego) no está disponible en  las traducciones, cargará inglés por defecto.",
        "text2":
          "Los textos de la página están localizados en un archivo JSON. Este archivo carga de manera asincrónica dado que una acción de Redux es ejecutada cuando cuando la aplicación está siendo montada. ",
        "text3":
          "Los idiomas disponibles se verán en la barra superior y una acción se despachará cada vez que alguno es seleccionado, modificando el contenido sin recargar todo el sitio. La librería Axios se utiliza para manejar todo el proceso asincrónico"
      }
    }
  }
]
